{"class_name": "Tokenizer", "config": {"num_words": 10000, "filters": "", "lower": true, "split": " ", "char_level": false, "oov_token": null, "document_count": 20, "word_counts": "{\"class\": 20, \"class1\": 20, \"1\": 124, \":\": 92, \"\\n\": 201, \"\\t\": 513, \"def\": 20, \"funct1\": 20, \"(\": 64, \"self\": 20, \",\": 66, \"arr\": 43, \"n\": 38, \")\": 64, \"var1\": 211, \"=\": 110, \"[\": 18, \"]\": 18, \"for\": 22, \"i\": 34, \"in\": 22, \"range\": 18, \"j\": 4, \"2\": 95, \"sum\": 1, \"+\": 24, \"'numlit'\": 74, \".\": 3, \"append\": 1, \"return\": 21, \"max\": 14, \"-'numlit'\": 13, \"if\": 29, \">\": 10, \"<\": 17, \"len\": 5, \"*\": 2, \"3\": 14, \"4\": 8, \"5\": 4, \"6\": 6, \"k\": 8, \"else\": 6, \"-\": 2, \"a\": 3, \"size\": 2, \"import\": 2, \"math\": 2, \"-math\": 2, \"inf\": 2, \"-float\": 3, \"\\\"strlit\\\"\": 3}", "word_docs": "{\"n\": 19, \"j\": 2, \"=\": 20, \"var1\": 20, \"append\": 1, \"self\": 20, \"+\": 20, \"(\": 20, \"class\": 20, \":\": 20, \"1\": 20, \"'numlit'\": 20, \"2\": 20, \",\": 20, \"i\": 16, \"sum\": 1, \"funct1\": 20, \"[\": 16, \"return\": 20, \"]\": 16, \"max\": 10, \"for\": 20, \"class1\": 20, \".\": 3, \"\\t\": 20, \"range\": 16, \"\\n\": 20, \"arr\": 19, \"def\": 20, \"in\": 20, \")\": 20, \"if\": 16, \"-'numlit'\": 13, \"<\": 13, \">\": 10, \"len\": 4, \"*\": 1, \"6\": 2, \"5\": 2, \"4\": 2, \"3\": 3, \"else\": 6, \"k\": 2, \"a\": 2, \"-\": 2, \"size\": 1, \"math\": 2, \"-math\": 2, \"inf\": 2, \"import\": 2, \"\\\"strlit\\\"\": 2, \"-float\": 2}", "index_docs": "{\"13\": 19, \"38\": 2, \"5\": 20, \"2\": 20, \"52\": 1, \"24\": 20, \"16\": 20, \"10\": 20, \"20\": 20, \"7\": 20, \"4\": 20, \"8\": 20, \"6\": 20, \"9\": 20, \"14\": 16, \"51\": 1, \"23\": 20, \"25\": 16, \"19\": 20, \"26\": 16, \"29\": 10, \"17\": 20, \"21\": 20, \"40\": 3, \"1\": 20, \"27\": 16, \"3\": 20, \"12\": 19, \"22\": 20, \"18\": 20, \"11\": 20, \"15\": 16, \"31\": 13, \"28\": 13, \"32\": 10, \"37\": 4, \"44\": 1, \"35\": 2, \"39\": 2, \"33\": 2, \"30\": 3, \"36\": 6, \"34\": 2, \"41\": 2, \"45\": 2, \"46\": 1, \"48\": 2, \"49\": 2, \"50\": 2, \"47\": 2, \"43\": 2, \"42\": 2}", "index_word": "{\"1\": \"\\t\", \"2\": \"var1\", \"3\": \"\\n\", \"4\": \"1\", \"5\": \"=\", \"6\": \"2\", \"7\": \":\", \"8\": \"'numlit'\", \"9\": \",\", \"10\": \"(\", \"11\": \")\", \"12\": \"arr\", \"13\": \"n\", \"14\": \"i\", \"15\": \"if\", \"16\": \"+\", \"17\": \"for\", \"18\": \"in\", \"19\": \"return\", \"20\": \"class\", \"21\": \"class1\", \"22\": \"def\", \"23\": \"funct1\", \"24\": \"self\", \"25\": \"[\", \"26\": \"]\", \"27\": \"range\", \"28\": \"<\", \"29\": \"max\", \"30\": \"3\", \"31\": \"-'numlit'\", \"32\": \">\", \"33\": \"4\", \"34\": \"k\", \"35\": \"6\", \"36\": \"else\", \"37\": \"len\", \"38\": \"j\", \"39\": \"5\", \"40\": \".\", \"41\": \"a\", \"42\": \"-float\", \"43\": \"\\\"strlit\\\"\", \"44\": \"*\", \"45\": \"-\", \"46\": \"size\", \"47\": \"import\", \"48\": \"math\", \"49\": \"-math\", \"50\": \"inf\", \"51\": \"sum\", \"52\": \"append\"}", "word_index": "{\"\\t\": 1, \"var1\": 2, \"\\n\": 3, \"1\": 4, \"=\": 5, \"2\": 6, \":\": 7, \"'numlit'\": 8, \",\": 9, \"(\": 10, \")\": 11, \"arr\": 12, \"n\": 13, \"i\": 14, \"if\": 15, \"+\": 16, \"for\": 17, \"in\": 18, \"return\": 19, \"class\": 20, \"class1\": 21, \"def\": 22, \"funct1\": 23, \"self\": 24, \"[\": 25, \"]\": 26, \"range\": 27, \"<\": 28, \"max\": 29, \"3\": 30, \"-'numlit'\": 31, \">\": 32, \"4\": 33, \"k\": 34, \"6\": 35, \"else\": 36, \"len\": 37, \"j\": 38, \"5\": 39, \".\": 40, \"a\": 41, \"-float\": 42, \"\\\"strlit\\\"\": 43, \"*\": 44, \"-\": 45, \"size\": 46, \"import\": 47, \"math\": 48, \"-math\": 49, \"inf\": 50, \"sum\": 51, \"append\": 52}"}}